content/posts/origin-story.md
+++
title = "Origin Story"
author = ["Chris Baker"]
date = 2025-05-13T16:52:00-07:00
draft = false
+++

I needed a place to store links and random notes to myself about things I figured out. I started keeping more meticulous notes in org-mode in Emacs, and I thought it might be nice to push some out onto the web. I settled on using [Hugo](https://gohugo.io/), as I wanted a static site, and [ox-hugo](https://ox-hugo.scripter.co/) exports cleanly to it. We'll see how it goes.
